using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Кудинов Даниил
/// 
/// а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.

namespace _5_а_
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Даниил Кудинов Санкт-Петербург");
            Console.ReadLine();
        }
    }
}
